from random import randint

"""
начальные сервера служат:
0 = простое поле
1 = камень
2 = медь
3 = уголь
4 = олово
5 = песок
6 = титан
7 = тротил
8 = уран
9 = иридий

дальше идет оборудование тоесть слоты для добавления
20...

5 = тестовое установления нового обьекта
"""
WIDTH = 1920
HEIGHT = 1080
FPS = 60
activ_menu_info = [1, False]
coord_xy = (WIDTH+100, HEIGHT+100)
active_menu_point1 = []
active_menu_point2 = []
active_menu_point3 = []
WHITE = (255, 255, 255)
BLACK = (0, 0, 0)
RED = (255, 0, 0)
GREEN = (0, 255, 0)
BLUE = (0, 0, 255)
#  ::::::::::::::::::::::::::::::::::::::::::::::::
"""металы словарь"""
objectInformationByNumber = {0: "air",
#::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                                1: "copper",
                                2: "coal",
                                3: "tin",
                                4: "sand",
                                5: "stone",
                                6: 'flint',
#::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                                7: "titan",
                                8: "tnt",
#::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                                9: "uranium",
                                10: "iridium",
                                11: "Tantalum",
#::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
                                12: 'lava',
                                13: 'water',
                                14: "wood"

                             }

"""
медь 1
уголь 2 
олово 3
песок 4
камень 5
кремнень 6

титан 7
тротил 8

уран 9
иридий 10
тантал 11

лава 12
вода 13
древесина 14
"""
resources = {'wood': 0,      # древесина
             'stone': 0,     # камень
             'lava': 0,      # лава
             'water': 0,     # вода
             'coal': 0,      # уголь
             'copper': 10000,  # медь
             'tin': 0,       # олово
             'titan': 0,     # титан
             'tnt': 0,       # тротил
             'Tantalum': 0,  # тантал
             'uranium': 0,   # уран
             'iridium': 0,   # иридий
             'energy': 0,    # энергия
             'sand': 0,      # песок
             'flint': 0,      # кремень
             'air': 0
             }

"""Преобразованные материалы"""
convertedMaterials = {
    'Polycarbonate': 0,  # полекарбонат
    'scrap': 0,  # лом
    'wires': 0,  # провода
    'plastic': 0  # пластик
    }
"""крафты для новых предметов добывча материала
в начале дается 1 добытчик ресурсов вместе с собирателем
    предметы для добычи
добытчик может добывать:
    1 камень
    2 медь
    3 уголь
    4 олово
    5 песок
добытчик 2 уровня может добывать:
    6 титан
    7 тротил
добытчик 3 уровень может добывать:
    8 уран
    9 иридий

спец. добытчик воды
спец. добытчик лава
    
    
добытчик = медь 500 штук


"""
rendering = []
for i in range(1, 7):
    for j in range(1, 7):
        pr3241 = randint(0, 10)
        if pr3241 == 1:
            pass
        else:
            rendering.append((j, i))


#  ::::::::::::::::::::::::::::::::::::::::::::::::
rendering1 = [
                     (4, 3), (5, 3), (6, 3), (7, 3),
             (3, 4), (4, 4), (5, 4), (6, 4), (7, 4), (8, 4),
             (2, 5), (3, 5), (4, 5), (5, 5), (6, 5), (7, 5), (8, 5),
             (2, 6), (3, 6), (4, 6), (5, 6), (6, 6), (7, 6),
             (2, 7), (3, 7), (4, 7), (5, 7), (6, 7), (7, 7), (8, 7),
             (2, 8), (3, 8), (4, 8), (5, 8), (6, 8), (7, 8), (8, 8),
                 (3, 9), (4, 9),         (7, 9)]

rendering2 = [(11, 4), (12, 4), (13, 4), (15, 4), (16, 4), (17, 4),
              (11, 5), (12, 5), (13, 5), (14, 5), (15, 5), (16, 5), (17, 5), (18, 5),
              (12, 6), (13, 6), (14, 6), (15, 6), (16, 6), (17, 6), (18, 6), (19, 6),
              (13, 7), (14, 7), (15, 7), (18, 7)
              ]
