
"""
начальные сервера служат:
0 = простое поле
1 = поле камня
2 = поле воды
3 = поле огня
4 = поле руд
дальше идет оборудование тоесть слоты для добавления
5...

5 = тестовое установления нового обьекта
"""
WIDTH = 1920
HEIGHT = 1080
FPS = 100
coin = 100
activ_menu_info = [1, False]
coord_xy = (WIDTH+100, HEIGHT+100)
active_menu_point1 = []
active_menu_point2 = []
active_menu_point3 = []
WHITE = (255, 255, 255)
BLACK = (0, 0, 0)
RED = (255, 0, 0)
GREEN = (0, 255, 0)
BLUE = (0, 0, 255)
#  ::::::::::::::::::::::::::::::::::::::::::::::::
"""металы словарь"""
resources = {'wood': 0,  # древесина
             'stone': 0,  # камень
             'lava': 0,  # лава
             'water': 0,  # вода
             'coal': 0,  # уголь
             'copper': 0,  # медь
             'tin': 0,  # олово
             'titan': 0,  # титан
             'tnt': 0,  # тротил
             'Tantalum': 0,  # тантал
             'uranium': 0,  # уран
             'iridium': 0,  # иридий
             'energy': 0,  # энергия
             'sand': 0,  # песок
             'flint': 0  # кремень
             }
"""Преобразованные материалы"""
convertedMaterials = {
    'Polycarbonate': 0,  # полекарбонат
    'scrap': 0,  # лом
    'wires': 0,  # провода
    'plastic': 0  # пластик

}
"""крафты для новых предметов добывча материала
в начале дается 1 добытчик ресурсов вместе с собирателем
добытчик может добывать:
    камень
    медь
    уголь
    олово
    медь
    песок
добытчик 2 уровня может добывать:
    титан
    тротил
добытчик 3 уровень может добывать:
    уран
    иридий

спец. добытчик воды
спец. добытчик лава
    
    
добытчик = медь 500 штук


"""

#  ::::::::::::::::::::::::::::::::::::::::::::::::
rendering1 = [
                     (4, 3), (5, 3), (6, 3), (7, 3),
             (3, 4), (4, 4), (5, 4), (6, 4), (7, 4), (8, 4),
             (2, 5), (3, 5), (4, 5), (5, 5), (6, 5), (7, 5), (8, 5),
             (2, 6), (3, 6), (4, 6), (5, 6), (6, 6), (7, 6),
             (2, 7), (3, 7), (4, 7), (5, 7), (6, 7), (7, 7), (8, 7),
             (2, 8), (3, 8), (4, 8), (5, 8), (6, 8), (7, 8), (8, 8),
                 (3, 9), (4, 9),         (7, 9)]

rendering2 = [(11, 4), (12, 4), (13, 4), (15, 4), (16, 4), (17, 4),
              (11, 5), (12, 5), (13, 5), (14, 5), (15, 5), (16, 5), (17, 5), (18, 5),
              (12, 6), (13, 6), (14, 6), (15, 6), (16, 6), (17, 6), (18, 6), (19, 6),
              (13, 7), (14, 7), (15, 7), (18, 7)
              ]
